import { Card, Col, Container, Row } from 'react-bootstrap';
import "../styles/style.scss";

function Delivery(){
    return (
        <Container>
            <section className='mb-4'>
                <h2 className='mb-4 text-center blockTitle'>ДОСТАВКА ТА ПОВЕРНЕННЯ</h2>
                <div className='mb-4'>
                    <h3 className="mb-4 text-center fw-bold" style={{fontSize: 24}}>Доставка замовлення</h3>
                    <Row xs={1} md={2} className="g-4">
                        <Col>
                            <Card className='h-100 p-3'>
                                <div className='text-center'>
                                    <Card.Img 
                                        style={{width: 60}}
                                        variant="top" src="https://babyplus.ua/images/orders/1649417540.png" />
                                </div>
                                <Card.Body>
                                    <Card.Title className='text-center'>УКРПОШТА</Card.Title>
                                    <Card.Text>
                                        Діє акційна безкоштовна доставка. При виборі післяплати, додатково оплачується комісія - 1% від суми, не менше 10 грн. Безкоштовне зберігання складі до 5 днів. Посилка повертається відправнику на 7 день зберігання. Термін доставки: 2-4 днів.
                                    </Card.Text>
                                </Card.Body>
                            </Card>
                        </Col>
                        <Col>
                            <Card className='h-100 p-3'>
                            <div className='text-center'>
                                <Card.Img 
                                    style={{width: 60}}
                                    variant="top" src="https://babyplus.ua/images/orders/1649417673.png" />
                            </div>
                                <Card.Body>
                                    <Card.Title className='text-center'>НОВА ПОШТА</Card.Title>
                                    <Card.Text>
                                        Вартість доставки залежить від ваги, габаритів посилки та суми, на яку страхується замовлення. При виборі післяплати, додатково оплачується комісія - 2% від суми + 20 грн. Термін зберігання посилки у відділенні - 5 днів, після цього терміну посилка повертається відправнику. Термін доставки: 1-2 дні.
                                    </Card.Text>
                                </Card.Body>
                            </Card>
                        </Col>
                    </Row>
                </div>
                <div className="return">
                    <h3>Возврат товаров</h3>
                    <p>Ви можете повернути товар продавця ПОИГРАЕМO протягом 14 днів від дня купівлі.</p>
                    <ol>
                        <li>
                            <h3>Запакуйте товар</h3>
                            <ul>
                                <li>Перевірте, чи ваш товар підлягає поверненню.</li>
                                <li>Покладіть новий товар без слідів експлуатації в оригінальну упаковку. Якщо товар складається з кількох частин, повернути треба весь комплект. Переконайтеся, що нічого не загубилося і ви повертаєте товар у тій комплектації, у якій його отримали.</li>
                                <li>Якщо ви придбали товар з подарунком при поверненні треба надати весь набір (товар разом з подарунком). Інакше номінальну вартість подарунка буде вирахувано із суми повернення.</li>
                                <li>Чек надсилати не обов’язково.</li>
                            </ul>
                        </li>
                        <li>
                            <h3>Заповніть бланк повернення товару</h3>
                            <p>Це можна зробити в особистому кабінеті на сайті. Або заповніть паперовий бланк, якщо ви отримали його разом з товаром.</p>
                            <p>Якщо ви втратили паперовий бланк, його можна знайти та роздрукувати тут.</p>
                            <p>Важливо:</p>
                            <ul>
                                <li>У бланку розбірливо вкажіть прізвище, ім’я, по батькові власника банківської картки українською мовою.</li>
                                <li>Переконайтеся, що ви заповнили всі поля.</li>
                            </ul>
                        </li>
                        <li>
                            <h3>Куди приносити товар</h3>
                            <p>Повернути товар можна у сервісному відділі чи пункті приймання повернень ПОИГРАЕМ.</p>
                            <ul>
                                <li>
                                    Сервісні відділи у точках видачі ПОГРАЄМО. Тут ми відразу перевіримо товар і, якщо з ним усе добре, на місці погодимо рішення щодо повернення.
                                </li>
                                <li>Пункти прийому повернень у точках видачі ПОИГРАЕМ. Тут наш співробітник проведе візуальний огляд вашого товару. Рішення стосовно товару приймається після доставки товару до сервісного відділу. З вами погодять деталі. Експертиза проводиться у період 14 днів.</li>
                            </ul>
                        </li>
                    </ol>
                </div>
            </section>
        </Container>
    )
}

export default Delivery;