import { Container } from 'react-bootstrap';
import Accordion from 'react-bootstrap/Accordion';
import "../styles/style.scss";

function QAA(){
    return (
        <Container>
            <section className="text-center">
                <h2 className="mb-3 blockTitle">Відповіді на питання</h2>
                <p className="p-4 mb-4 lh-base">
                    Нижче Ви знайдете відповіді на популярні питання. Якщо Ви не знайшли відповіді на своє запитання - зв'яжіться з нашим відділом продаж. Наші менеджери завжди допоможуть Вам і зможуть надати розгорнуту відповідь на усі питання, що Вас цікавлять, з приводу роботи нашого інтернет магазину.
                </p>
                <Accordion className='text-start mb-5'>
                    <Accordion.Item eventKey="0">
                        <Accordion.Header>ЯК ЗАЯВИТИ ПРО ОПЛАТУ?</Accordion.Header>
                        <Accordion.Body>
                            <p>
                                Заявити оплату можна заповнивши форму у Особистому кабінеті у розділі Зв'язатися з магазином "Зворотній зв'язок", а також по телефону. Щоб заявити платіж, вкажіть номер замовлення, точну суму і точний час оплати.
                            </p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="1">
                        <Accordion.Header>ЯК ШВИДКО ВИ ЗБИРАЄТЕ ТА ВІДПРАВЛЯЄТЕ ЗАМОВЛЕННЯ?</Accordion.Header>
                        <Accordion.Body>
                            <p>
                                Збір і відправка здійснюється на протязі 1-2 робочих дня. Після того, як Ваше замовлення буде зібрано та буде зарахована оплата за замовленням, у разі вибору оплати по реквізитах, він відвантажується на обрану Вами кур'єрську службу. Відвантаження відбувається до 12-00 щодня, окрім неділі і святкових днів (про такі дні ми попереджаємо заздалегідь на нашому сайті). З міста велика частина наших відправок від'їжджає в день відвантаження (виключення: субота, святкові дні, завантаженість кур'єрської служби). Терміни доставки залежать від обраної Вами кур'єрської служби і віддаленості Вашого населеного пункту.
                            </p>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="2">
                        <Accordion.Header>ЯК ШВИДКО ЗАМОВЛЕННЯ БУДЕ ДОСТАВЛЕНЕ В МОЄ МІСТО?</Accordion.Header>
                        <Accordion.Body>
                            <p>
                                Усі служби перевезень доставляють посилки в різні терміни. Приблизні терміни доставки замовлення можна розрахувати на сайтах кур'єрських служб (відправка здійснюється з м. Одеса). Зазвичай кур'єрські служби доставляють вантажі за ніч тільки у великі міста по основних своїх логістичних напрямах.
                            </p>
                            За швидкістю доставки :
                            <ul>
                                <li>НП (1-2 дні).</li>
                                <li>Delivery (1-3 дні).</li>
                                <li>УкрПошта (2-4 дні).</li>
                                <li>Meest (3-7 днів).</li>
                            </ul>
                        </Accordion.Body>
                    </Accordion.Item>
                    <Accordion.Item eventKey="3">
                        <Accordion.Header>ЯК Я МОЖУ ДІЗНАТИСЯ ВАРТІСТЬ ДОСТАВКИ?</Accordion.Header>
                        <Accordion.Body>
                            <p>
                                Вартість доставки замовлення залежить від обраної Вами кур'єрської служби та її тарифів на перевезення (детальніше про тарифи можна дізнатися на сайтах кур'єрських служб). Приблизно формула розрахунку вартості перевезення складається з суми наступних складових : 
                            </p>
                            <ul>
                                <li>оформлення самої декларації (від 15 до 23 грн. залежно від кур'єрської служби);</li>
                                <li>страховки вантажу (від 0,5% до 2%);</li>
                                <li>вага/об'єм вантажу, що відправляється.</li>
                            </ul>
                            <p>
                                Укрпошта має інші тарифи. Ознайомитися з ними можна на офіційному сайті або у відділенні. При виборі способу оплати "післяплата", крім вартості доставки, Вам необхідно буде сплатити на пошті вартість цієї послуги :
                            </p>
                            <ul>
                                <li>-НП (20 грн +2% від суми замовлення)</li>
                                <li>-Укрпочта (1% від суми замовлення, мінімум 5 грн)</li>
                            </ul>
                            <p>
                                В деяких випадках можливі виключення.
                            </p>
                        </Accordion.Body>
                    </Accordion.Item>
                </Accordion>
            </section>
        </Container>
    )
}

export default QAA;